Tekla Open API Reference for Tekla Structures 2025
Position.DepthEnum Enumeration
 The position in the depth sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DepthEnum
Public Enumeration DepthEnum
Members
Member name | Value | Description
MIDDLE | 0 |  The middle option.
FRONT | 1 |  The front option.
BEHIND | 2 |  The behind option.
See Also
Reference
Tekla.Structures.Model Namespace